import React from "react"
import { connect } from "react-redux"

// components
import Heading from "../components/Heading"
// containers
import Card from "./Card"
import Footer from "./Footer"

const Page02_00 = props => {

  const { heading } = props.page02_00

  return (
    <div className="Page02_00 page">

      <Heading main={heading.main} sub={heading.sub} />

      <section>
        Mission：使命・存在意義
Vison：目標・あるべき姿
Value：価値観・行動指針
</section>

      <section>
        Mission　
「衣・食・住・健・美」の生活文化を事業領域に定め、今までにない新しい価値やライフスタイルの創造を通じて、世界中のあらゆる人々の生活に幸せと彩りを届け、心豊かな社会の実現に貢献します。

Vision
香りのプロフェッショナルという強みを活かしながら、自由な発想と独自の技術で常識を打破し、感動ある商品を生み出すことで、既存の枠にとらわれない新しい生活文化を提案し、新たなマーケットを開拓し続けるオンリーワン企業をめざします。

Value
Integrity：誠実な行動
私たちは法令・社会規範を遵守し、あらゆる場面で、あらゆる人々に対して、誠実、親切、公正に接する。

Creativity：発想力と創造性
既成概念にとらわれない柔軟で豊かな発想力で、オリジナリティあふれる新しい価値を創造する。

Challenge：挑戦し続ける
困難なことにも強い意志と情熱を持って積極的に挑み、粘り強く新たな可能性を拓いていく。

Fun：「楽しい」を探求
私たち自身が「楽しい」「面白い」と感じるものを。その「楽しい」がお客様の「感動」につながる。

Harmony：協調性と主体性
一人一人が個性と能力を活かし、互いにリスペクトし合いながら、自ら考え、自ら行動する。
      </section>


      <section>
        <h1>社名の由来</h1>
社名の「May lily」は、英語でスズランを意味する言葉です。

鮮やかな緑の葉の影に、鈴のような小さな白い花が重なって咲くスズランは、清楚で可憐な美しさがある花です。
その控えめな姿とは裏腹に、寒さにとても強く、必ず春に花を咲かせるたくましい生命力を持つ花でもあります。
地中を這うように茎を伸ばし、年を追うごとに驚くべき勢いでに増え、いつしか一面を埋め尽くすようにスズランが咲き広がります。

スズランは香水の世界でも存在感があり、バラ、ジャスミンとともに「三大フローラルノート」と呼ばれ、調合には欠かせない重要な香りです。
透明感のある清楚な香りは主役にもなりますが、調合した香りの調和を図り、香りに広がりやまろやかさを与えるハーモナイザーとしての役割があります。

また、ヨーロッパでは、春の訪れを知らせるスズランは「幸福をもたらす花」として愛されてきました。
結婚式で花嫁にスズランの花束を贈ったり、フランスでは、５月１日「スズランの日」に大切な人とスズランを贈り合い、幸福を祈ります。

“心豊かな暮らしに役立つ製品を提供し、人々に幸せを届け、世界に幸せの輪を広げる”
“社会との調和をめざし、会社の強みや人材・リソースを活用して、社会貢献に取り組む”
“ベンチャー企業として常にチャレンジを行い、強くたくましく成長する企業をめざす”

これがメイリリィという社名に込めた想いです。
      </section>

      <section>
        <h1>ロゴマーク</h1>
私たちは2018年7月より、この新しいシンボルマークを導入しました。
4つの白い円は、スズランの花と新しい価値を創造する力を、
緑の三角形は、先駆的な製品を開発し、事業を開拓していく企業姿勢を、
青い扇形は、メイリリィが届ける幸せが世界に広がるようにとの願いを表現しています。
      </section>

      <Footer />
    </div>
  )
}

const mapStateToProps = state => ({
  routes: state.routes,
  page02_00: state.routes.page02_00,
})

export default connect(mapStateToProps)(Page02_00)
